examples/plasma-jet/target/1_flow/0.org/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 1.0e5;

boundaryField
{
    gasInlet
    {
        type            zeroGradient;
    }

    airInlet
    {
        type            totalPressure;
        p0              $internalField;
    }

    region0_to_dielectric
    {
        type            zeroGradient;
    }

    outlet
    {
        type            zeroGradient;
    }

    topBoundary
    {
        type            totalPressure;
        p0              $internalField;
    }

    axis
    {
        type            empty;
    }

    frontWedge
    {
        type            wedge;
    }

    backWedge
    {
        type            wedge;
    }
}


// ************************************************************************* //
