examples/plasma-jet/target/1_flow/system/createBafflesDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      createBafflesDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

internalFacesOnly true;

baffles
{
    tubeExitBaffle
    {
        //- Use predefined faceZone to select faces and orientation.
        type        faceZone;
        zoneName    tubeExitZone;

        patches
        {
            master
            {
                name        tubeExit;
                type        patch;
            }
            slave
            {
                $master;
            }
        }
    }
}


// ************************************************************************* //
